Revit 2024 API
EnergyAnalysisConstruction.ConstructionName Property
 The name of the construction
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public string ConstructionName { get; }
Visual Basic
Public ReadOnly Property ConstructionName As String
	Get
Visual C++
public:
property String^ ConstructionName {
	String^ get ();
}
See Also
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace